# Q.A Series

In [1]:
# import the library
import pandas as pd

# a

In [2]:
# create a series
pd.Series([7,11,13,17])

# b

In [3]:
pd.Series([100.0]*5)

# c

In [4]:
# import library to generate random numbers.
import random
x = random.sample(range(0, 101), 20)

In [5]:
# random numbers
x

In [6]:
# create series
y = pd.Series(x)

# describe
y.describe()

count    20.000000
mean     41.650000
std      26.450102
min       1.000000
25%      23.250000
50%      38.500000
75%      59.250000
max      88.000000
dtype: float64

# d

In [7]:
temperatures = pd.Series([98.6,98.9,100.2,97.9],index=['Julie','Charlie','Sam','Andrea'])
temperatures

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

# e

In [8]:
mydict = dict(temperatures)
mydict

{'Julie': 98.6, 'Charlie': 98.9, 'Sam': 100.2, 'Andrea': 97.9}

In [9]:
pd.Series(mydict)

Julie       98.6
Charlie     98.9
Sam        100.2
Andrea      97.9
dtype: float64

# Q.B Pandas

# f

In [10]:
temperature_dict = {'Maxine': [31,37,35.1], 'James': [34.7,32,39],'Amanda':[37.7,35,33]} 
temperature = pd.DataFrame(temperature_dict)

In [11]:
temperature

   Maxine  James  Amanda
0    31.0   34.7    37.7
1    37.0   32.0    35.0
2    35.1   39.0    33.0

# g

In [12]:
temperature = pd.DataFrame(temperature_dict,index=['Morning','Afternoon','Evening'])

In [13]:
temperature

           Maxine  James  Amanda
Morning      31.0   34.7    37.7
Afternoon    37.0   32.0    35.0
Evening      35.1   39.0    33.0

# h

In [14]:
temperature[['Maxine']]

           Maxine
Morning      31.0
Afternoon    37.0
Evening      35.1

# i

In [15]:
temperature.loc[['Morning']]

         Maxine  James  Amanda
Morning    31.0   34.7    37.7

# j

In [16]:
temperature.loc[['Morning','Evening']]

         Maxine  James  Amanda
Morning    31.0   34.7    37.7
Evening    35.1   39.0    33.0

# k

In [17]:
temperature[['Amanda','Maxine']]

           Amanda  Maxine
Morning      37.7    31.0
Afternoon    35.0    37.0
Evening      33.0    35.1

# l

In [18]:
temperature.loc[['Morning','Afternoon'],['Amanda','Maxine']]

           Amanda  Maxine
Morning      37.7    31.0
Afternoon    35.0    37.0

# m

In [19]:
temperature.describe()

          Maxine      James     Amanda
count   3.000000   3.000000   3.000000
mean   34.366667  35.233333  35.233333
std     3.066486   3.530345   2.358672
min    31.000000  32.000000  33.000000
25%    33.050000  33.350000  34.000000
50%    35.100000  34.700000  35.000000
75%    36.050000  36.850000  36.350000
max    37.000000  39.000000  37.700000

# n

In [20]:
temperature.transpose()

        Morning  Afternoon  Evening
Maxine     31.0       37.0     35.1
James      34.7       32.0     39.0
Amanda     37.7       35.0     33.0

# o

In [21]:
# sort temperature as per their column name
temperature.sort_index(axis=1,key=lambda x: x.str.lower())

           Amanda  James  Maxine
Morning      37.7   34.7    31.0
Afternoon    35.0   32.0    37.0
Evening      33.0   39.0    35.1